anergy7/esp-skainet-s3/examples/cn_speech_commands_recognition/esp32-s3-LEDbuiltin/sdkconfig.defaults
# ESP32-S3 specific configuration
CONFIG_IDF_TARGET="esp32s3"

# Enable UART for logging
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000

# GPIO configuration
CONFIG_GPIO_ESP32_SUPPORT_SWITCH_SLP_PULL=y